emsesp/EMS-ESP32/src/core/analogsensor.cpp
/*
 * EMS-ESP - https://github.com/emsesp/EMS-ESP
 * Copyright 2020  Paul Derbyshire
 * 
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */

#include "analogsensor.h"
#include "emsesp.h"

namespace emsesp {

uuid::log::Logger AnalogSensor::logger_{F_(analogsensor), uuid::log::Facility::DAEMON};

#ifndef EMSESP_STANDALONE
portMUX_TYPE  mux                     = portMUX_INITIALIZER_UNLOCKED;
unsigned long AnalogSensor::edge[]    = {0, 0, 0};
unsigned long AnalogSensor::edgecnt[] = {0, 0, 0};

void IRAM_ATTR AnalogSensor::freqIrq0() {
    portENTER_CRITICAL_ISR(&mux);
    edgecnt[0]++;
    edge[0] = micros();
    portEXIT_CRITICAL_ISR(&mux);
}
void IRAM_ATTR AnalogSensor::freqIrq1() {
    portENTER_CRITICAL_ISR(&mux);
    edgecnt[1]++;
    edge[1] = micros();
    portEXIT_CRITICAL_ISR(&mux);
}
void IRAM_ATTR AnalogSensor::freqIrq2() {
    portENTER_CRITICAL_ISR(&mux);
    edgecnt[2]++;
    edge[2] = micros();
    portEXIT_CRITICAL_ISR(&mux);
}
#endif

void AnalogSensor::start(const bool factory_settings) {
    // if (factory_settings && EMSESP::nvs_.getString("boot").equals("E32V2_2") && EMSESP::nvs_.getString("hwrevision").equals("3.0")) {
    if (factory_settings && analogReadMilliVolts(39) > 700) { // core voltage > 2.6V
        EMSESP::webCustomizationService.update([&](WebCustomization & settings) {
            auto newSensor = AnalogCustomization();

            newSensor.gpio      = 39;
            newSensor.name      = "core_voltage";
            newSensor.offset    = 0;
            newSensor.factor    = 0.00377136; // Divider 24k - 8,66k
            newSensor.uom       = DeviceValueUOM::VOLTS;
            newSensor.type      = AnalogType::ADC;
            newSensor.is_system = true;
            settings.analogCustomizations.push_back(newSensor);

            newSensor.gpio      = 36;
            newSensor.name      = "supply_voltage";
            newSensor.factor    = 0.017; // Divider 24k - 1,5k
            newSensor.is_system = true;
            settings.analogCustomizations.push_back(newSensor);

            return StateUpdateResult::CHANGED; // persist the change
        });
    }
    reload(true); // fetch the list of sensors from our customization service

    if (!analog_enabled_) {
        return;
    }

    analogSetAttenuation(ADC_11db); // for all channels 3.3V

    LOG_INFO("Starting Analog Sensor service");

    // Add API calls
    Command::add(
        EMSdevice::DeviceType::ANALOGSENSOR,
        F_(setvalue),
        [&](const char * value, const int8_t id) { return command_setvalue(value, id); },
        FL_(setiovalue_cmd),
        CommandFlag::ADMIN_ONLY);

    char topic[Mqtt::MQTT_TOPIC_MAX_SIZE];
    snprintf(topic, sizeof(topic), "%s/#", F_(analogsensor));
    Mqtt::subscribe(EMSdevice::DeviceType::ANALOGSENSOR, topic, nullptr); // use empty function callback
}

// load settings from the customization file, sorts them and initializes the GPIOs
void AnalogSensor::reload(bool get_nvs) {
    EMSESP::webSettingsService.read([&](WebSettings & settings) { analog_enabled_ = settings.analog_enabled; });

#if defined(EMSESP_STANDALONE)
    analog_enabled_ = true; // for local offline testing
#endif
    for (auto sensor : sensors_) {
        remove_ha_topic(sensor.type(), sensor.gpio());
        sensor.ha_registered = false;
    }

    if (!analog_enabled_) {
        sensors_.clear();
        return;
    }
    changed_ = true;
    // load the list of analog sensors from the customization service
    // and store them locally and then activate them
    EMSESP::webCustomizationService.read([&](WebCustomization & settings) {
        auto it = sensors_.begin();
        for (auto & sensor_ : sensors_) {
            // update existing sensors
            bool found = false;
            for (const auto & sensor : settings.analogCustomizations) { // search customlist
                if (sensor_.gpio() == sensor.gpio) {
                    // for output sensors set value to new start-value
                    if (sensor.type >= AnalogType::DIGITAL_OUT && sensor.type <= AnalogType::PWM_2
                        && (sensor_.type() != sensor.type || sensor_.offset() != sensor.offset || sensor_.factor() != sensor.factor)) {
                        sensor_.set_value(sensor.offset);
                    }
                    if (sensor.type == AnalogType::COUNTER && sensor_.offset() != sensor.offset
                        && sensor.offset != EMSESP::nvs_.getDouble(sensor.name.c_str(), 0)) {
                        EMSESP::nvs_.putDouble(sensor.name.c_str(), sensor.offset);
                        sensor_.set_value(sensor.offset);
                    }
                    sensor_.set_name(sensor.name);
                    sensor_.set_type(sensor.type);
                    sensor_.set_offset(sensor.offset);
                    sensor_.set_factor(sensor.factor);
                    sensor_.set_uom(sensor.uom);
                    sensor_.ha_registered = false;
                    found                 = true;
                }
            }
            if (!found) {
                sensors_.erase(it);
            }
            it++;
        }

        // add new sensors from list
        for (const auto & sensor : settings.analogCustomizations) {
            bool found = false;
            for (const auto & sensor_ : sensors_) {
                if (sensor_.gpio() == sensor.gpio) {
                    found = true;
                }
            }
            if (!found) {
                // it's new
                // check if the GPIO is valid before registering. If not, force set the sensor to disabled, but don't remove it
                // should only trigger if uploading a customization file with invalid gpios.
                AnalogType type = static_cast<AnalogType>(sensor.type);
                if (!EMSESP::system_.check_valid_gpio(sensor.gpio, "Analog Sensor")) {
                    continue;
                }
                sensors_.emplace_back(sensor.gpio, sensor.name, sensor.offset, sensor.factor, sensor.uom, type, sensor.is_system);

